Repository: Adam-s-tech/FluentCleaner
Catalog: FluentCleaner/Strings/*/Resources.resw
Source language: en_us
Languages: hu_hu

# NavCleaner.Content
source: Cleaner
hu_hu: Tisztítás

# NavTerminal.Content
source: Terminal
hu_hu: Terminál

# NavCustom.Content
source: Custom
hu_hu: Egyéni

# SearchBox.PlaceholderText
source: Search
hu_hu: Keresés

# BtnPageActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Page actions
hu_hu: Oldal műveletei

# DonationBanner.Title
source: Enjoying FluentCleaner?
hu_hu: Tetszik a FluentCleaner?

# DonationBanner.Subtitle
source: If this app saves you time, consider supporting its development.
hu_hu: Ha ez az alkalmazás időt spórol neked, fontold meg a fejlesztés támogatását.

# BtnDonateGitHub.Content
source: Star on GitHub
hu_hu: Csillagozd a GitHubon

# BtnDonateLater.Content
source: Maybe later
hu_hu: Talán később

# St_NoActions
source: No actions for this page
hu_hu: Ehhez az oldalhoz nincsenek műveletek

# CleanerHint.Text
source: Winapp2.ini loads automatically at startup.
hu_hu: A Winapp2.ini automatikusan betöltődik induláskor.

# BtnCategoryActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Category actions
hu_hu: Kategória műveletei

# MenuSelectAll.Text
source: Select all
hu_hu: Összes kijelölése

# MenuSelectNone.Text
source: Select none
hu_hu: Kijelölés törlése

# MenuSelectDefaults.Text
source: Select defaults
hu_hu: Alapértelmezettek kijelölése

# MenuAnalyzeCategory.Text
source: Analyze category
hu_hu: Kategória elemzése

# MenuCleanCategory.Text
source: Clean category
hu_hu: Kategória tisztítása

# BtnEntryActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Entry actions
hu_hu: Bejegyzés műveletei

# MenuAnalyzeEntry.Text
source: Analyze
hu_hu: Elemzés

# MenuCleanEntry.Text
source: Clean
hu_hu: Tisztítás

# MenuExplainEntry.Text
source: Explain with AI
hu_hu: Magyarázat AI-val

# MenuShowSource.Text
source: Show source
hu_hu: Forrás megjelenítése

# LblAIDesc.Text
source: Right-click any entry on the Cleaner page → Explain with AI. Powered by Groq (llama-3.3-70b) — free, no billing. Nothing is sent without your explicit action. Requires your own API key.
hu_hu: Kattints jobb gombbal bármelyik bejegyzésre a Tisztítás oldalon → Magyarázat AI-val. Válassz a Groq, OpenAI vagy Anthropic közül. Semmi sem kerül elküldésre a kifejezett hozzájárulásod nélkül. Saját API-kulcs szükséges.

# LblAICustomHint.Text
source: 💡 Once your key is saved, the Custom Cleaners page also unlocks AI — describe what to clean and it generates a ready-to-use Winapp2 entry or PowerShell script for you.
hu_hu: 💡 Miután elmentetted a kulcsot, az Egyéni tisztítók oldalon is elérhetővé válik az AI — írd le, mit szeretnél tisztítani, és kész Winapp2-bejegyzést vagy PowerShell-szkriptet generál neked.

# ResultsHeader.Text
source: Results
hu_hu: Eredmények

# BtnBackToResults.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Back to results
hu_hu: Vissza az eredményekhez

# BtnCleanDetail.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete these files now
hu_hu: Fájlok törlése most

# MenuExcludeFile.Text
source: Exclude file
hu_hu: Fájl kizárása

# MenuExcludeFolder.Text
source: Exclude folder
hu_hu: Mappa kizárása

# BtnAnalyze.Content
source: Analyze
hu_hu: Elemzés

# BtnCancel.Content
source: Cancel
hu_hu: Mégse

# BtnRunCleaner.Content
source: Run Cleaner
hu_hu: Tisztítás indítása

# St_MenuSelectAll
source: Select all
hu_hu: Összes kijelölése

# St_MenuSelectNone
source: Select none
hu_hu: Kijelölés törlése

# St_MenuSelectDefaults
source: Select defaults
hu_hu: Alapértelmezettek kijelölése

# St_MenuExpandAll
source: Expand all
hu_hu: Összes kibontása

# St_MenuCollapseAll
source: Collapse all
hu_hu: Összes összecsukása

# St_MenuSortDesc
source: Sort by size ↓
hu_hu: Rendezés méret szerint ↓

# St_MenuSortAsc
source: Sort by size ↑
hu_hu: Rendezés méret szerint ↑

# St_MenuRefresh
source: Refresh
hu_hu: Frissítés

# DetailHeaderFiles.Text
source: Files
hu_hu: Fájlok

# DetailHeaderRegistry.Text
source: Registry
hu_hu: Rendszerleíró adatbázis

# SuffixFiles
source: files
hu_hu: fájl

# SuffixRegistry
source: registry
hu_hu: rendszerleíró adatbázis

# SuffixFilesSingular
source: file(s)
hu_hu: fájl(ok)

# SuffixRegistryItems
source: registry item(s)
hu_hu: rendszerleíró bejegyzés(ek)

# LabelCleaningComplete
source: Cleaning complete.
hu_hu: A tisztítás befejeződött.

# DlgBrowsersTitle
source: Browsers running
hu_hu: Böngészők futnak

# DlgBrowsersContinue
source: Continue anyway
hu_hu: Folytatás mindenképp

# DlgBrowsersCancel
source: Cancel
hu_hu: Mégse

# DlgBrowsersMessage
source: Close these apps for best results:\n{0}\n\nOpen browsers lock cache and history files — they will be skipped during cleaning.
hu_hu: A legjobb eredmény érdekében zárd be ezeket az alkalmazásokat:\n{0}\n\nA nyitva lévő böngészők zárolják a gyorsítótár- és előzményfájlokat — ezek kimaradnak a tisztításból.

# DlgWarningTitle
source: Cleaning warning
hu_hu: Tisztítási figyelmeztetés

# DlgWarningContinue
source: Continue
hu_hu: Folytatás

# DlgWarningCancel
source: Cancel
hu_hu: Mégse

# DlgWarningMessage
source: The selected Winapp2 entries include the following warnings:
hu_hu: A kijelölt Winapp2-bejegyzések a következő figyelmeztetéseket tartalmazzák:

# DlgExplainThinking
source: Thinking…
hu_hu: Gondolkodom…

# DlgExplainClose
source: Close
hu_hu: Bezárás

# DlgSourceCopy
source: Copy
hu_hu: Másolás

# DlgSourceReport
source: Report entry
hu_hu: Bejegyzés jelentése

# DlgSourceDryRun
source: Dry Run
hu_hu: Próbafuttatás

# RuleLabTitle
source: Rule Lab — {0}
hu_hu: Szabálylabor — {0}

# DlgSourceHint
source: Edit the rules, then Dry Run to preview the hits.
hu_hu: Szerkeszd a szabályokat, majd futtass egy próbafuttatást a találatok előnézetéhez.

# DlgSourceScanning
source: Scanning…
hu_hu: Vizsgálat…

# DlgSourceNoEntry
source: No valid entry — needs a Detect and a FileKey.
hu_hu: Nincs érvényes bejegyzés — Detect és FileKey szükséges.

# DlgSourceFound
source: {0} files · {1}
hu_hu: {0} fájl · {1}

# DlgSourceMore
source: … and {0} more
hu_hu: … és még {0}

# DlgSourceError
source: Scan failed: {0}
hu_hu: A vizsgálat sikertelen: {0}

# DlgSourceCancel
source: Cancel
hu_hu: Mégse

# DlgSourceCancelled
source: Cancelled.
hu_hu: Megszakítva.

# DlgRestartTitle
source: Restart required
hu_hu: Újraindítás szükséges

# DlgRestartMessage
source: FluentCleaner needs to restart to apply the changes.
hu_hu: A FluentCleaner újraindítása szükséges a változtatások alkalmazásához.

# DlgRestartNow
source: Restart now
hu_hu: Újraindítás most

# DlgRestartLater
source: Later
hu_hu: Később

# St_Loading
source: Loading Winapp2.ini...
hu_hu: Winapp2.ini betöltése...

# St_SearchFound
source: Showing {0} matching entries.
hu_hu: {0} egyező bejegyzés megjelenítve.

# St_SearchNone
source: No matching entries.
hu_hu: Nincs egyező bejegyzés.

# St_ParsingDatabases
source: Parsing databases...
hu_hu: Adatbázisok feldolgozása...

# St_AnalysisReady
source: Analysis ready — {0} apps found in {1} entries.
hu_hu: Elemzés kész — {0} alkalmazás található {1} bejegyzésben.

# St_NothingSelected
source: Nothing selected.
hu_hu: Nincs kijelölés.

# St_Scanning
source: Scanning...
hu_hu: Vizsgálat...

# St_ScanComplete
source: Scan complete — {0} files, {1} registry items ({2})
hu_hu: A vizsgálat kész — {0} fájl, {1} rendszerleíró bejegyzés ({2})

# St_ScanCancelled
source: Scan cancelled.
hu_hu: A vizsgálat megszakítva.

# St_Cleaning
source: Cleaning...
hu_hu: Tisztítás...

# St_CleanDone
source: Finished — {0} freed · {1} skipped (files in use)
hu_hu: Kész — {0} felszabadítva · {1} kihagyva (fájlok használatban)

# St_CleanDoneSimple
source: Finished — {0} items removed · {1} freed.
hu_hu: Kész — {0} elem eltávolítva · {1} felszabadítva.

# St_CleanCancelledBytes
source: Clean cancelled — {0} freed so far.
hu_hu: A tisztítás megszakítva — eddig {0} szabadult fel.

# St_CleanCancelled
source: Clean cancelled.
hu_hu: A tisztítás megszakítva.

# St_EntryScanned
source: {0}: {1} files, {2} registry items
hu_hu: {0}: {1} fájl, {2} rendszerleíró bejegyzés

# St_EntryNothingToClean
source: {0}: nothing to clean.
hu_hu: {0}: nincs mit tisztítani.

# St_EntryCleanDone
source: {0}: {1} items removed · {2} freed.
hu_hu: {0}: {1} elem eltávolítva · {2} felszabadítva.

# St_CategoryScanning
source: Scanning {0}...
hu_hu: {0} vizsgálata...

# St_CategoryScanned
source: {0} scanned — {1} entries.
hu_hu: {0} megvizsgálva — {1} bejegyzés.

# St_CategoryCleaning
source: Cleaning {0}...
hu_hu: {0} tisztítása...

# St_CategoryCleanDone
source: {0}: {1} items removed · {2} freed.
hu_hu: {0}: {1} elem eltávolítva · {2} felszabadítva.

# St_EntryScanningProgress
source: Scanning {0}...
hu_hu: {0} vizsgálata...

# St_ExcludedFile
source: Excluded: {0}
hu_hu: Kizárva: {0}

# St_ExcludedFolder
source: Excluded: {0}
hu_hu: Kizárva: {0}

# Prog_Deleted
source: Deleted: {0}
hu_hu: Törölve: {0}

# Prog_Registry
source: Registry: {0}
hu_hu: Rendszerleíró adatbázis: {0}

# SettingsTitle.Text
source: Settings
hu_hu: Beállítások

# DonationBar.Title
source: FluentCleaner is going open source.
hu_hu: A FluentCleaner nyílt forráskódúvá válik.

# DonationBar.Message
source: Put a lot of work into this — if it helps you and you feel like saying thanks, a donation would really mean a lot. ♥
hu_hu: Sok munka fekszik ebben a projektben — ha segít neked, és szívesen megköszönnéd, egy adomány sokat jelentene. ♥

# BtnDonate.Content
source: Support the project
hu_hu: Projekt támogatása

# MenuDonatePayPal.Text
source: Donate via PayPal
hu_hu: Adományozás PayPal-lal

# MenuDonateKoFi.Text
source: Donate via Ko-fi
hu_hu: Adományozás Ko-fi-n

# SectionAppearance.Text
source: Appearance
hu_hu: Megjelenés

# LblTheme.Text
source: App theme
hu_hu: Alkalmazás témája

# LblThemeDesc.Text
source: Choose how FluentCleaner looks on your device.
hu_hu: Válaszd ki, hogyan nézzen ki a FluentCleaner az eszközödön.

# ThemeSystem.Content
source: System default
hu_hu: Rendszer alapértelmezett

# ThemeLight.Content
source: Light
hu_hu: Világos

# ThemeDark.Content
source: Dark
hu_hu: Sötét

# LblLanguage.Text
source: Language
hu_hu: Nyelv

# LblLanguageDesc.Text
source: Override the display language. Restart required to apply.
hu_hu: A megjelenítési nyelv felülbírálása. Az alkalmazáshoz újraindítás szükséges.

# St_LangAuto
source: System default
hu_hu: Rendszer alapértelmezett

# SectionDatabase.Text
source: Database
hu_hu: Adatbázis

# LblDatabaseDesc.Text
source: Choose which entry lists are loaded for scanning and cleaning.
hu_hu: Válaszd ki, mely bejegyzéslisták töltődjenek be a vizsgálathoz és tisztításhoz.

# BtnUpdateWinapp2.Content
source: Update
hu_hu: Frissítés

# LblWinapp3Tag.Text
source: experimental
hu_hu: kísérleti

# LblWinapp3Desc.Text
source: — more aggressive entries, use at your own risk.
hu_hu: — agresszívabb bejegyzések, saját felelősségre használd.

# BtnDownloadWinapp3.Content
source: Download
hu_hu: Letöltés

# BtnUpdateWinapp3.Content
source: Update
hu_hu: Frissítés

# LblWinappxDesc.Text
source: — AppX / bloatware entries for the terminal debloater.
hu_hu: — AppX / bloatware bejegyzések a terminálos eltávolítóhoz.

# BtnDownloadWinappx.Content
source: Download
hu_hu: Letöltés

# BtnUpdateWinappx.Content
source: Update
hu_hu: Frissítés

# TxtCustomPath.PlaceholderText
source: Custom database path (.ini)
hu_hu: Egyéni adatbázis elérési útja (.ini)

# BtnBrowse.Content
source: Browse…
hu_hu: Tallózás…

# BtnApplyPath.Content
source: Apply
hu_hu: Alkalmaz

# BtnRemovePath.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove custom database
hu_hu: Egyéni adatbázis eltávolítása

# RestartBar.Title
source: Restart required
hu_hu: Újraindítás szükséges

# RestartBar.Message
source: Please restart FluentCleaner to load the updated database.
hu_hu: Indítsd újra a FluentCleanert a frissített adatbázis betöltéséhez.

# SectionPostClean.Text
source: Post-clean tasks
hu_hu: Tisztítás utáni feladatok

# LblPostCleanDesc.Text
source: One command per line — runs sequentially after every clean pass.
hu_hu: Soronként egy parancs — minden tisztítási kör után egymás után lefutnak.

# SectionExclusions.Text
source: Global exclusions
hu_hu: Globális kizárások

# LblExclusionsDesc.Text
source: Paths listed here are never cleaned — overrides all database rules.
hu_hu: Az itt felsorolt elérési utak sosem kerülnek tisztításra — felülbírálja az összes adatbázis-szabályt.

# LnkProtectedPaths.Content
source: View protected paths
hu_hu: Védett elérési utak megtekintése

# DlgProtectedTitle
source: Protected paths
hu_hu: Védett elérési utak

# DlgProtectedDesc
source: These are always skipped, no matter what the database says. They hold browser extension data that some apps (password managers, ad blockers) break without.
hu_hu: Ezek mindig kimaradnak, függetlenül attól, mit mond az adatbázis. Böngészőbővítmény-adatokat tartalmaznak, amelyek nélkül egyes alkalmazások (jelszókezelők, hirdetésblokkolók) nem működnek megfelelően.

# SectionHistory.Text
source: History
hu_hu: Előzmények

# LblHistoryDesc.Text
source: Track how much junk accumulates over time.
hu_hu: Kövesd nyomon, mennyi felesleg gyűlik össze idővel.

# LblCleanHistory.Text
source: Clean history
hu_hu: Előzmények törlése

# BtnClearHistory.Content
source: Clear history
hu_hu: Előzmények törlése

# SectionAI.Text
source: AI explanations
hu_hu: AI-magyarázatok

# LblAIOptIn.Text
source: opt-in
hu_hu: opcionális

# LblAIPreview.Text
source: preview
hu_hu: előzetes

# BtnAIDiscussion.Content
source: Thoughts? Join the discussion →
hu_hu: Van véleményed? Csatlakozz a beszélgetéshez →

# BtnSaveApiKey.Content
source: Save
hu_hu: Mentés

# BtnTestApiKey.Content
source: Test
hu_hu: Teszt

# BtnGetApiKey.Content
source: Get key
hu_hu: Kulcs beszerzése

# SectionBackup.Text
source: Backup
hu_hu: Biztonsági mentés

# LblBackupDesc.Text
source: Export or import your settings as a JSON file. Drop a settings.json next to the exe for portable mode.
hu_hu: Exportáld vagy importáld a beállításaidat JSON fájlként. Helyezz egy settings.json fájlt az exe mellé a hordozható módhoz.

# BtnExport.Content
source: Export
hu_hu: Exportálás

# BtnImport.Content
source: Import
hu_hu: Importálás

# LblPortableActive.Text
source: 📦 Portable mode active — settings stored next to exe
hu_hu: 📦 Hordozható mód aktív — a beállítások az exe mellett tárolódnak

# SectionAbout.Text
source: About
hu_hu: Névjegy

# BtnReportIssue.Content
source: Report an issue
hu_hu: Hiba bejelentése

# BtnIconCredit.Content
source: App icon by naderi
hu_hu: Az alkalmazás ikonja: naderi

# BtnFAQ.Content
source: FAQ
hu_hu: GYIK

# St_Winapp3NotDownloaded
source: Winapp3 not downloaded yet — click Download.
hu_hu: A Winapp3 még nincs letöltve — kattints a Letöltésre.

# St_WinappxNotDownloaded
source: Winappx not downloaded yet — click Download.
hu_hu: A Winappx még nincs letöltve — kattints a Letöltésre.

# St_HistoryNone
source: no runs recorded yet
hu_hu: még nincs rögzített futtatás

# St_HistorySummary
source: {0} runs · {1} total freed
hu_hu: {0} futtatás · összesen {1} felszabadítva

# St_HistoryItems
source: {0} items
hu_hu: {0} elem

# St_FileNotFound
source: File not found: {0}
hu_hu: A fájl nem található: {0}

# St_CustomPathSaved
source: Custom path saved.
hu_hu: Egyéni elérési út elmentve.

# St_Download
source: Download
hu_hu: Letöltés

# St_Downloading
source: Downloading {0}…
hu_hu: {0} letöltése…

# St_Downloaded
source: {0} downloaded — {1} KB
hu_hu: {0} letöltve — {1} KB

# St_DownloadFailed
source: Download failed: {0}
hu_hu: A letöltés sikertelen: {0}

# St_FileInfoNotDownloaded
source: Not downloaded
hu_hu: Nincs letöltve

# St_FileInfo
source: {0} entries • {1} KB • {2}
hu_hu: {0} bejegyzés • {1} KB • {2}

# St_UpdateAvailable
source: Update available — {0}
hu_hu: Frissítés elérhető — {0}

# St_UpdateMessage
source: A new version of FluentCleaner is ready to download.
hu_hu: A FluentCleaner új verziója letölthető.

# St_UpToDate
source: You're up to date
hu_hu: Naprakész vagy

# St_UpToDateMessage
source: Version {0} is the latest.
hu_hu: A(z) {0} verzió a legfrissebb.

# St_MenuUpdate
source: ⬆ Update available — {0}
hu_hu: ⬆ Frissítés elérhető — {0}

# St_MenuCheckUpdates
source: Check for updates
hu_hu: Frissítések keresése

# St_ApiKeyMissing
source: ⚠ Enter an API key first.
hu_hu: ⚠ Először add meg az API-kulcsot.

# St_ApiKeyTesting
source: Testing…
hu_hu: Tesztelés…

# St_ExportSuccess
source: Settings exported to {0}
hu_hu: A beállítások exportálva ide: {0}

# St_ExportFailed
source: Export failed: {0}
hu_hu: Az exportálás sikertelen: {0}

# St_ImportSuccess
source: Settings imported from {0}
hu_hu: A beállítások importálva innen: {0}

# St_ImportFailed
source: Import failed: {0}
hu_hu: Az importálás sikertelen: {0}

# CustomTitle.Text
source: Custom Cleaners
hu_hu: Egyéni tisztítók

# CustomEmptyHint.Text
source: No custom cleaners yet.
hu_hu: Még nincs egyéni tisztító.

# CustomEmptyHint2.Text
source: Create a new cleaner — it will appear here automatically.
hu_hu: Hozz létre egy új tisztítót — automatikusan megjelenik itt.

# MenuEditEntry.Text
source: Edit
hu_hu: Szerkesztés

# MenuDeleteEntry.Text
source: Delete
hu_hu: Törlés

# MenuTestEntry.Text
source: Test in Rule Lab
hu_hu: Tesztelés a Szabálylaborban

# MenuRunEntry.Text
source: Run
hu_hu: Futtatás

# BtnNewCleaner.Content
source: + New Cleaner
hu_hu: + Új tisztító

# BtnRunScript.Text
source: Run
hu_hu: Futtatás

# St_CustomStatus
source: {0} cleaner · {1} enabled
hu_hu: {0} tisztító · {1} engedélyezve

# St_CustomStatusScripts
source: {0} script(s)
hu_hu: {0} szkript

# St_CustomMenuNew
source: New custom cleaner
hu_hu: Új egyéni tisztító

# St_CustomMenuOpenFolder
source: Open Custom folder
hu_hu: Egyéni mappa megnyitása

# St_CustomMenuReddit
source: Ask on Reddit
hu_hu: Kérdezz a Redditen

# St_CustomMenuNeowin
source: Neowin forums
hu_hu: Neowin fórumok

# St_CustomMenuShare
source: Share cleaner on GitHub
hu_hu: Tisztító megosztása GitHubon

# St_CustomToggleFailed
source: Toggle failed: {0}
hu_hu: A váltás sikertelen: {0}

# St_CustomDeleteTitle
source: Delete "{0}"?
hu_hu: Törlöd ezt: „{0}”?

# St_CustomDeleteMessage
source: This removes the custom cleaner permanently.
hu_hu: Ez véglegesen eltávolítja az egyéni tisztítót.

# St_CustomDeleteConfirm
source: Delete
hu_hu: Törlés

# St_CustomDeleteCancel
source: Cancel
hu_hu: Mégse

# St_CustomRunning
source: Running {0}...
hu_hu: {0} futtatása...

# St_CustomScriptError
source: {0}: could not read script — {1}
hu_hu: {0}: a szkript nem olvasható — {1}

# St_CustomCompleted
source: {0}: completed successfully.
hu_hu: {0}: sikeresen befejeződött.

# St_CustomFailed
source: {0}: failed (exit {1}).
hu_hu: {0}: sikertelen (kilépési kód: {1}).

# St_CustomEntryNone
source: no entries parsed
hu_hu: nincs feldolgozott bejegyzés

# St_CustomEntryOne
source: 1 entry · {0}
hu_hu: 1 bejegyzés · {0}

# St_CustomEntryMany
source: {0} entries · {1}
hu_hu: {0} bejegyzés · {1}

# St_CustomEntryEnabled
source: enabled
hu_hu: engedélyezve

# St_CustomEntryDisabled
source: disabled
hu_hu: letiltva

# DlgNewCleanerSave
source: Save
hu_hu: Mentés

# DlgNewCleanerCancel
source: Cancel
hu_hu: Mégse

# DlgNewCleanerTypeIni.Content
source: Winapp2 entry (.ini)
hu_hu: Winapp2-bejegyzés (.ini)

# DlgNewCleanerTypePs1.Content
source: PowerShell script (.ps1)
hu_hu: PowerShell-szkript (.ps1)

# DlgNewCleanerNameHeader
source: Name
hu_hu: Név

# DlgNewCleanerNamePlaceholder
source: My Cleaner
hu_hu: Saját tisztító

# DlgNewCleanerAiPlaceholder
source: Generate with AI - describe what to clean (results may vary)
hu_hu: Generálás AI-val – írd le, mit szeretnél tisztítani (az eredmény változó lehet)

# DlgNewCleanerGenerate.Content
source: Generate
hu_hu: Generálás

# DlgNewCleanerGenerateBtn
source: Generate
hu_hu: Generálás

# DlgNewCleanerContentLabel
source: Content
hu_hu: Tartalom

# DlgNewCleanerTest
source: Test in Rule Lab
hu_hu: Tesztelés a Szabálylaborban

# DlgNewCleanerLoadTemplate.Content
source: Load template
hu_hu: Sablon betöltése

# DlgNewCleanerTitleNew
source: New custom cleaner
hu_hu: Új egyéni tisztító

# DlgNewCleanerTitleEdit
source: Edit — {0}
hu_hu: Szerkesztés — {0}

# AI_NoKey
source: No API key configured. Go to Settings → AI explanations to add your Groq API key (free at console.groq.com).
hu_hu: Nincs beállítva API-kulcs a kiválasztott szolgáltatóhoz. Menj a Beállítások → AI-magyarázatok részhez, hogy hozzáadj egyet.

# AI_ApiError
source: Groq API error: {0}
hu_hu: {0} API-hiba: {1}

# AI_NoResponse
source: No response received.
hu_hu: Nem érkezett válasz.

# AI_NetworkError
source: Could not reach Groq API: {0}
hu_hu: Nem sikerült elérni: {0}: {1}

# AI_NoKeyShort
source: No API key configured — go to Settings → AI explanations.
hu_hu: Nincs beállítva API-kulcs — menj a Beállítások → AI-magyarázatok részhez.

# CLI_Welcome
source: FluentCleaner Terminal online.
hu_hu: FluentCleaner Terminál elindult.

# CLI_Databases
source: Databases: {0} active — {1} detected entries
hu_hu: Adatbázisok: {0} aktív — {1} felismert bejegyzés

# CLI_HelpHint
source: Type 'help' for commands.
hu_hu: Írd be: 'help' a parancsokért.

# CLI_UnknownCommand
source: Unknown command '{0}'. Type 'help'.
hu_hu: Ismeretlen parancs: '{0}'. Írd be: 'help'.

# CLI_NoDrives
source: No drives found.
hu_hu: Nem található meghajtó.

# CLI_ThemeUsage
source: Usage: theme dark | light | system
hu_hu: Használat: theme dark | light | system

# CLI_ThemeSet
source: Theme set to '{0}'.
hu_hu: Téma beállítva: '{0}'.

# CLI_BackdropUsage
source: Usage: backdrop mica | acrylic
hu_hu: Használat: backdrop mica | acrylic

# CLI_BackdropSet
source: Backdrop set to '{0}'.
hu_hu: Háttér beállítva: '{0}'.

# CLI_NoMatch
source: No entries matching '{0}'.
hu_hu: Nincs egyező bejegyzés: '{0}'.

# CLI_CleanEntry
source: {0}: {1} items · {2}
hu_hu: {0}: {1} elem · {2}

# CLI_CleanDone
source: Done — {0} items removed · {1} freed.
hu_hu: Kész — {0} elem eltávolítva · {1} felszabadítva.

# CLI_NothingToClean
source: Nothing to clean.
hu_hu: Nincs mit tisztítani.

# CLI_AnalyzeEntry
source: {0}: {1} files · {2} registry · {3}
hu_hu: {0}: {1} fájl · {2} rendszerleíró adatbázis · {3}

# CLI_AnalyzeTotal
source: Total: {0} found.
hu_hu: Összesen: {0} találat.

# CLI_NothingFound
source: Nothing found.
hu_hu: Nincs találat.

# CLI_ListEntries
source: — {0} entries.
hu_hu: — {0} bejegyzés.

# CLI_ListCategories
source: — {0} categories.
hu_hu: — {0} kategória.

# CLI_AppxUsage
source: Usage: appx list | appx scan | appx remove <name> | appx remove all
hu_hu: Használat: appx list | appx scan | appx remove <név> | appx remove all

# CLI_AppxListStart
source: Listing all installed AppX packages...
hu_hu: Az összes telepített AppX-csomag listázása...

# CLI_AppxNoPackages
source: No packages found.
hu_hu: Nem található csomag.

# CLI_AppxListDone
source: — {0} package(s) installed. Use 'appx remove <name>' to uninstall.
hu_hu: — {0} csomag telepítve. Az eltávolításhoz használd: 'appx remove <név>'.

# CLI_AppxScanStart
source: Scanning installed packages...
hu_hu: Telepített csomagok vizsgálata...

# CLI_AppxNothingFound
source: Nothing found — system looks clean.
hu_hu: Nincs találat — a rendszer tisztának tűnik.

# CLI_AppxScanDone
source: — {0} package(s) found. Use 'appx remove <name>' or 'appx remove all'.
hu_hu: — {0} csomag található. Használd: 'appx remove <név>' vagy 'appx remove all'.

# CLI_AppxRemoveUsage
source: Usage: appx remove <name> | appx remove all
hu_hu: Használat: appx remove <név> | appx remove all

# CLI_AppxRemoveScanStart
source: Scanning for installed packages...
hu_hu: Telepített csomagok keresése...

# CLI_AppxNothingToRemove
source: Nothing to remove.
hu_hu: Nincs mit eltávolítani.

# CLI_AppxRemoving
source: Removing {0}...
hu_hu: {0} eltávolítása...
